back-end/loadtest.yml
config:
  target: "http://localhost:5000"   # Your backend URL (update if deployed)
  phases:
    - duration: 60       # Run for 1 minute
      arrivalRate: 5     # 5 users per second
    - duration: 60
      arrivalRate: 10    # Increase to 10 users/sec (scalability test)
  processor: "./processor.js"

scenarios:
  - name: "Certificate Generation and Verification"
    flow:
      - function: "generateHash"
      - post:
          url: "/verifyCertificate"
          json:
            certificateId: "{{ certificateId }}"
            ipfsHash: "{{ ipfsHash }}"